# shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.cockroachdb_serverless_cluster.cockroach_cluster.default: Refreshing state... [id=7b5d6c4f-8a7c-4fc6-800e-a2fe8feab939]
module.common_resources.module.kafka_serverless_cluster.upstash_kafka_cluster.default: Refreshing state... [id=upstash-cluster-3aaef659-0f9f-4ab3-8c97-1bb7e0ee9ec9]
module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default: Refreshing state... [id=upstash-kafka-credential-450d6976-4808-49d5-a408-04cc68a55ebc]
module.common_resources.module.cockroachdb_serverless_cluster.aws_ssm_parameter.default: Refreshing state... [id=cockroachdb_serverless_cluster_id]
module.common_resources.aws_secretsmanager_secret.kafka_topic_credential: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:064003852748:secret:upstash_kafka_credential-vaHJmo]
module.common_resources.module.kafka_topic_credential.aws_ssm_parameter.default: Refreshing state... [id=upstash_kafka_cluster_credential]
module.common_resources.module.simple_email_service.aws_ses_domain_identity.default: Refreshing state... [id=mail.connectilly.com]
module.common_resources.module.kafka_serverless_cluster.aws_ssm_parameter.default: Refreshing state... [id=upstash_kafka_cluster_id]
module.common_resources.aws_secretsmanager_secret_version.secret_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:064003852748:secret:upstash_kafka_credential-vaHJmo|CC5089F2-BE3C-4B3B-ADF8-D24D0D2CB6AC]
module.common_resources.module.simple_email_service.aws_ses_domain_dkim.default: Refreshing state... [id=mail.connectilly.com]
module.common_resources.module.cognito_user_pool.aws_cognito_user_pool.default: Refreshing state... [id=us-east-1_gl21W78mM]
module.common_resources.module.cognito_user_pool.aws_cognito_user_pool_domain.default: Refreshing state... [id=connectilly]
module.common_resources.module.cognito_user_pool.aws_cognito_identity_provider.google_provider: Refreshing state... [id=us-east-1_gl21W78mM:Google]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.common_resources.module.cognito_user_pool.aws_cognito_identity_provider.google_provider will be updated in-place
  ~ resource "aws_cognito_identity_provider" "google_provider" {
        id                = "us-east-1_gl21W78mM:Google"
      ~ provider_details  = {
          - "attributes_url"                = "https://people.googleapis.com/v1/people/me?personFields=" -> null
          - "attributes_url_add_attributes" = "true" -> null
          - "authorize_url"                 = "https://accounts.google.com/o/oauth2/v2/auth" -> null
          - "oidc_issuer"                   = "https://accounts.google.com" -> null
          - "token_request_method"          = "POST" -> null
          - "token_url"                     = "https://www.googleapis.com/oauth2/v4/token" -> null
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_topic_credential.aws_ssm_parameter.default must be replaced
-/+ resource "aws_ssm_parameter" "default" {
      ~ arn            = "arn:aws:ssm:us-east-1:064003852748:parameter/upstash_kafka_cluster_credential" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "upstash_kafka_cluster_credential" -> (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      ~ name           = "upstash_kafka_cluster_credential" -> "upstash_kafka_cluster_credential_id" # forces replacement
        tags           = {
            "environment"   = "production"
            "resource"      = "shared"
            "resource_type" = "kafka-topic-credential"
        }
      ~ tier           = "Standard" -> (known after apply)
      ~ version        = 1 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*